QUESTIONS = [
    {
        "text": "Как ты обычно проводишь выходные?",
        "options": [
            "Исследую новые места и активно двигаюсь.",
            "Отдыхаю дома, читаю книги или смотрю фильмы.",
            "Встречаюсь с друзьями и устраиваю вечеринки.",
            "Занимаюсь творчеством: рисую, пишу или что-то мастерю."
        ],
        "scores": {
            '1': [{"Лиса": 4}, {"Волк": 3}, {"Орёл": 2}, {"Жираф": 1}],
            '2': [{"Кошка": 4}, {"Черепаха": 3}, {"Панда": 2}, {"Ёж": 1}],
            '3': [{"Пингвин": 4}, {"Обезьяна": 3}, {"Волк": 2}, {"Попугай": 1}],
            '4': [{"Попугай": 4}, {"Фенек": 3}, {"Панда": 2}, {"Жираф": 1}]
        }
    },
    {
        "text": "Какой цвет тебе ближе всего?",
        "options": ["Ярко-красный.",
                    "Спокойный голубой.",
                    "Зелёный.",
                    "Чёрный или фиолетовый."
                    ],
        "scores": {
            '1': [{"Тигр": 4}, {"Пантера": 3}, {"Лиса": 2}, {"Орёл": 1}],
            '2': [{"Сова": 4}, {"Олень": 3}, {"Черепаха": 2}, {"Жираф": 1}],
            '3': [{"Змея": 4}, {"Черепаха": 3}, {"Жираф": 2}, {"Панда": 1}],
            '4': [{"Пантера": 4}, {"Змея": 3}, {"Крокодил": 2}, {"Волк": 1}]
        }
    },
    {
        "text": "Ты больше любишь...",
        "options": ["Действовать быстро и решительно.",
                    "Обдумывать каждое решение.",
                    "Быть в центре внимания.",
                    "Оставаться незамеченным, но влиять из тени."
                    ],
        "scores": {
            '1': [{"Тигр": 4}, {"Лиса": 3}, {"Пантера": 2}, {"Волк": 1}],
            '2': [{"Сова": 4}, {"Черепаха": 3}, {"Орёл": 2}, {"Кошка": 1}],
            '3': [{"Попугай": 4}, {"Лев": 3}, {"Фенек": 2}, {"Орёл": 1}],
            '4': [{"Лиса": 4}, {"Змея": 3}, {"Черепаха": 2}, {"Кошка": 1}]
        }
    },
    {
        "text": "Как ты реагируешь на конфликты?",
        "options": ["Нападаю первым, чтобы защитить себя.",
                    "Пытаюсь мирно разрешить ситуацию.",
                    "Использую харизму, чтобы всех успокоить.",
                    "Ухожу от конфликта и наблюдаю со стороны."
                    ],
        "scores": {
            '1': [{"Тигр": 4}, {"Лев": 3}, {"Волк": 2}, {"Крокодил": 1}],
            '2': [{"Панда": 4}, {"Черепаха": 3}, {"Сова": 2}, {"Олень": 1}],
            '3': [{"Лев": 4}, {"Попугай": 3}, {"Орёл": 2}, {"Фенек": 1}],
            '4': [{"Кошка": 4}, {"Черепаха": 3}, {"Сова": 2}, {"Ёж": 1}]
        }
    },
    {
        "text": "Что ты ценишь больше всего?",
        "options": ["Свободу и независимость.",
                    "Гармонию и спокойствие.",
                    "Признание и успех.",
                    "Мудрость и знания."
                    ],
        "scores": {
            '1': [{"Кошка": 4}, {"Орёл": 3}, {"Волк": 2}, {"Лиса": 1}],
            '2': [{"Панда": 4}, {"Черепаха": 3}, {"Сова": 2}, {"Олень": 1}],
            '3': [{"Лев": 4}, {"Орёл": 3}, {"Попугай": 2}, {"Тигр": 1}],
            '4': [{"Сова": 4}, {"Черепаха": 3}, {"Змея": 2}, {"Орёл": 1}]
        }
    },
    {
        "text": "Какой тип музыки ты предпочитаешь?",
        "options": ["Энергичную и громкую.",
                    "Медитативную и расслабляющую.",
                    "Популярную и танцевальную.",
                    "Альтернативную или классическую."
                    ],
        "scores": {
            '1': [{"Тигр": 4}, {"Лев": 3}, {"Волк": 2}, {"Попугай": 1}],
            '2': [{"Черепаха": 4}, {"Панда": 3}, {"Сова": 2}, {"Олень": 1}],
            '3': [{"Попугай": 4}, {"Фенек": 3}, {"Лиса": 2}, {"Пингвин": 1}],
            '4': [{"Сова": 4}, {"Орёл": 3}, {"Кошка": 2}, {"Жираф": 1}]
        }
    },
    {
        "text": "Ты скорее...",
        "options": ["Лидер.",
                    "Миротворец.",
                    "Душа компании.",
                    "Наблюдатель."
                    ],
        "scores": {
            '1': [{"Лев": 4}, {"Орёл": 3}, {"Волк": 2}, {"Тигр": 1}],
            '2': [{"Панда": 4}, {"Черепаха": 3}, {"Сова": 2}, {"Олень": 1}],
            '3': [{"Попугай": 4}, {"Фенек": 3}, {"Лиса": 2}, {"Пингвин": 1}],
            '4': [{"Сова": 4}, {"Кошка": 3}, {"Черепаха": 2}, {"Ёж": 1}]
        }
    },
    {
        "text": "Как ты относишься к изменениям?",
        "options": ["Приветствую их с энтузиазмом.",
                    "Боюсь, что они нарушат мой комфорт.",
                    "Всегда готов адаптироваться.",
                    "Анализирую их последствия."
                    ],
        "scores": {
            '1': [{"Лиса": 4}, {"Фенек": 3}, {"Попугай": 2}, {"Олень": 1}],
            '2': [{"Кошка": 4}, {"Черепаха": 3}, {"Ёж": 2}, {"Панда": 1}],
            '3': [{"Лиса": 4}, {"Волк": 3}, {"Фенек": 2}, {"Черепаха": 1}],
            '4': [{"Сова": 4}, {"Черепаха": 3}, {"Орёл": 2}, {"Кошка": 1}]
        }
    },
    {
        "text": "Что ты выбираешь на обед?",
        "options": ["Что-то острое и экзотическое.",
                    "Простую и полезную еду.",
                    "Что-то красиво оформленное и вкусное.",
                    "Что-то необычное, с глубоким вкусом."
                    ],
        "scores": {
            '1': [{"Фенек": 4}, {"Попугай": 3}, {"Лиса": 2}, {"Жираф": 1}],
            '2': [{"Панда": 4}, {"Черепаха": 3}, {"Олень": 2}, {"Жираф": 1}],
            '3': [{"Попугай": 4}, {"Фенек": 3}, {"Жираф": 2}, {"Орёл": 1}],
            '4': [{"Лиса": 4}, {"Орёл": 3}, {"Змея": 2}, {"Жираф": 1}]
        }
    },
    {
        "text": "Как ты принимаешь решения?",
        "options": ["Полагаюсь на интуицию.",
                    "Взвешиваю все 'за' и 'против'.",
                    "Слушаю советы окружающих.",
                    "Долго размышляю над деталями."
                    ],
        "scores": {
            '1': [{"Сова": 4}, {"Кошка": 3}, {"Змея": 2}, {"Ёж": 1}],
            '2': [{"Сова": 4}, {"Черепаха": 3}, {"Орёл": 2}, {"Кошка": 1}],
            '3': [{"Волк": 4}, {"Пингвин": 3}, {"Обезьяна": 2}, {"Олень": 1}],
            '4': [{"Черепаха": 4}, {"Сова": 3}, {"Кошка": 2}, {"Орёл": 1}]
        }
    },
    {
        "text": "Твой идеальный отдых — это...",
        "options": ["Экстремальные виды спорта.",
                    "Спа-процедуры и медитация.",
                    "Шумная вечеринка на пляже.",
                    "Одиночное путешествие в неизведанные места."
                    ],
        "scores": {
            '1': [{"Тигр": 4}, {"Лев": 3}, {"Орёл": 2}, {"Волк": 1}],
            '2': [{"Панда": 4}, {"Черепаха": 3}, {"Сова": 2}, {"Кошка": 1}],
            '3': [{"Попугай": 4}, {"Фенек": 3}, {"Лиса": 2}, {"Пингвин": 1}],
            '4': [{"Лиса": 4}, {"Волк": 3}, {"Орёл": 2}, {"Кошка": 1}]
        }
    },
    {
        "text": "Как ты проявляешь свои чувства?",
        "options": ["Открыто и страстно.",
                    "Сдержанно и мягко.",
                    "Ярко и эмоционально.",
                    "Через действия, а не слова."
                    ],
        "scores": {
            '1': [{"Лев": 4}, {"Тигр": 3}, {"Попугай": 2}, {"Орёл": 1}],
            '2': [{"Олень": 4}, {"Кошка": 3}, {"Панда": 2}, {"Черепаха": 1}],
            '3': [{"Попугай": 4}, {"Лев": 3}, {"Тигр": 2}, {"Фенек": 1}],
            '4': [{"Волк": 4}, {"Тигр": 3}, {"Медведь": 2}, {"Орёл": 1}]
        }
    },
    {
        "text": "Какое качество ты больше всего ценишь в людях?",
        "options": ["Храбрость.",
                    "Доброта.",
                    "Обаяние.",
                    "Интеллект."
                    ],
        "scores": {
            '1': [{"Лев": 4}, {"Тигр": 3}, {"Орёл": 2}, {"Волк": 1}],
            '2': [{"Панда": 4}, {"Олень": 3}, {"Кошка": 2}, {"Черепаха": 1}],
            '3': [{"Попугай": 4}, {"Лиса": 3}, {"Фенек": 2}, {"Лев": 1}],
            '4': [{"Сова": 4}, {"Орёл": 3}, {"Лиса": 2}, {"Черепаха": 1}]
        }
    },
    {
        "text": "Ты скорее...",
        "options": ["Действуешь импульсивно.",
                    "Планируешь всё заранее.",
                    "Подстраиваешься под ситуацию.",
                    "Анализируешь каждую деталь."
                    ],
        "scores": {
            '1': [{"Лиса": 4}, {"Фенек": 3}, {"Тигр": 2}, {"Попугай": 1}],
            '2': [{"Сова": 4}, {"Черепаха": 3}, {"Орёл": 2}, {"Кошка": 1}],
            '3': [{"Лиса": 4}, {"Волк": 3}, {"Фенек": 2}, {"Черепаха": 1}],
            '4': [{"Сова": 4}, {"Черепаха": 3}, {"Кошка": 2}, {"Орёл": 1}]
        }
    },
    {
        "text": "Как ты относишься к новым знакомствам?",
        "options": ["Всегда открыт к общению.",
                    "Сначала наблюдаю со стороны.",
                    "Легко нахожу общий язык с людьми.",
                    "Предпочитаю углублённые разговоры."
                    ],
        "scores": {
            '1': [{"Попугай": 4}, {"Пингвин": 3}, {"Лиса": 2}, {"Обезьяна": 1}],
            '2': [{"Кошка": 4}, {"Ёж": 3}, {"Черепаха": 2}, {"Сова": 1}],
            '3': [{"Попугай": 4}, {"Лиса": 3}, {"Пингвин": 2}, {"Обезьяна": 1}],
            '4': [{"Сова": 4}, {"Кошка": 3}, {"Орёл": 2}, {"Черепаха": 1}]
        }
    },
    {
        "text": "Что тебя больше всего вдохновляет?",
        "options": ["Приключения и вызовы.",
                    "Красота природы.",
                    "Люди и их истории.",
                    "Знания и мудрость."
                    ],
        "scores": {
            '1': [{"Лиса": 4}, {"Тигр": 3}, {"Орёл": 2}, {"Волк": 1}],
            '2': [{"Олень": 4}, {"Панда": 3}, {"Черепаха": 2}, {"Сова": 1}],
            '3': [{"Попугай": 4}, {"Обезьяна": 3}, {"Лиса": 2}, {"Пингвин": 1}],
            '4': [{"Сова": 4}, {"Орёл": 3}, {"Черепаха": 2}, {"Кошка": 1}]
        }
    },
    {
        "text": "Ты скорее...",
        "options": ["Рискнёшь ради большого выигрыша.",
                    "Выберешь безопасный и проверенный путь.",
                    "Послушаешь советы друзей.",
                    "Проанализируешь все возможные варианты."
                    ],
        "scores": {
            '1': [{"Тигр": 4}, {"Лев": 3}, {"Орёл": 2}, {"Лиса": 1}],
            '2': [{"Черепаха": 4}, {"Кошка": 3}, {"Ёж": 2}, {"Панда": 1}],
            '3': [{"Волк": 4}, {"Пингвин": 3}, {"Обезьяна": 2}, {"Олень": 1}],
            '4': [{"Сова": 4}, {"Черепаха": 3}, {"Кошка": 2}, {"Орёл": 1}]
        }
    },
    {
        "text": "Как ты относишься к правилам?",
        "options": ["Часто нарушаю их.",
                    "Следую им безоговорочно.",
                    "Приспосабливаюсь к ситуации.",
                    "Изучаю их, чтобы найти лазейки."
                    ],
        "scores": {
            '1': [{"Лиса": 4}, {"Тигр": 3}, {"Волк": 2}, {"Фенек": 1}],
            '2': [{"Черепаха": 4}, {"Панда": 3}, {"Олень": 2}, {"Кошка": 1}],
            '3': [{"Лиса": 4}, {"Волк": 3}, {"Фенек": 2}, {"Черепаха": 1}],
            '4': [{"Лиса": 4}, {"Кошка": 3}, {"Волк": 2}, {"Фенек": 1}]
        }
    },
    {
        "text": "Какой климат тебе ближе?",
        "options": ["Жаркий и знойный.",
                    "Умеренный и мягкий.",
                    "Теплый и солнечный.",
                    "Холодный и суровый."
                    ],
        "scores": {
            '1': [{"Фенек": 4}, {"Крокодил": 3}, {"Пантера": 2}, {"Попугай": 1}],
            '2': [{"Олень": 4}, {"Ёж": 3}, {"Медведь": 2}, {"Панда": 1}],
            '3': [{"Лев": 4}, {"Жираф": 3}, {"Попугай": 2}, {"Пантера": 1}],
            '4': [{"Пингвин": 4}, {"Медведь": 3}, {"Волк": 2}, {"Сова": 1}]
        }
    },
    {
        "text": "Если бы ты мог выбрать сверхспособность, что бы это было?",
        "options": ["Сила и скорость.",
                    "Исцеление и гармония.",
                    "Управление людьми.",
                    "Чтение мыслей и предвидение."
                    ],
        "scores": {
            '1': [{"Лев": 4}, {"Тигр": 3}, {"Пантера": 2}, {"Волк": 1}],
            '2': [{"Панда": 4}, {"Сова": 3}, {"Черепаха": 2}, {"Жираф": 1}],
            '3': [{"Лев": 4}, {"Змея": 3}, {"Орёл": 2}, {"Обезьяна": 1}],
            '4': [{"Сова": 4}, {"Орёл": 3}, {"Змея": 2}, {"Лиса": 1}]
        }
    },
]
