RESULTS = {
    "Лев": {
        "image": "lion.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "114939dc-d35b-4999-a317-9858875cf56c.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Лев!</b> 🔥 \n"
                "<b>Лев</b> — <i>лидер, смелый, энергичный.</i> 😎"
    },
    "Сова": {
        "image": "owl.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "380f0859-78ba-463e-a7e5-daf7107e62aa.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Сова!</b> 🔥 \n"
                "<b>Сова</b> — <i>мудрая, наблюдательная, загадочная.</i> 😎"
    },
    "Волк": {
        "image": "wolf.jpg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "a26086b0-53a3-452a-8552-5f5cef835879.jpg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Волк!</b> 🔥 \n"
                "<b>Волк</b> — <i>верный, страстный, независимый.</i> 😎"
    },
    "Медведь": {
        "image": "bear.jpg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "ed76230c-5e33-4ca3-9e6a-4d536a461682.JPG",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Медведь!</b> 🔥 \n"
                "<b>Медведь</b> — <i>сильный, защищающий, практичный</i> 😎"
    },
    "Лиса": {
        "image": "fox.jpg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "0a440c09-f451-4665-930d-de09bf6af09b.jpg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Лиса!</b> 🔥 \n"
                "<b>Лиса</b> — <i>хитрая, ловкая, находчивая.</i> 😎"
    },
    "Орёл": {
        "image": "eagle.jpg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "dd1fc6ee-2ff4-42f9-a775-c003bb9eae5b.jpg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Орёл!</b> 🔥 \n"
                "<b>Орёл</b> — <i>амбициозный, свободолюбивый, решительный.</i> 😎"
    },
    "Кошка": {
        "image": "cat.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "d8c918dc-4605-4f29-b4cf-c38d90ecac98.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Кошка!</b> 🔥 \n"
                "<b>Кошка</b> — <i>независимая, грациозная, интуитивная.</i> 😎"
    },
    "Змея": {
        "image": "snake.png",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "4d3f6497-1a66-4798-9472-df3c6e48ef35.png",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Змея!</b> 🔥 \n"
                "<b>Змея</b> — <i>мистическая, таинственная, проницательная.</i> 😎"
    },
    "Черепаха": {
        "image": "turtle.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "5583715a-3e34-4bd5-aab1-96ee50ed4af3.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Черепаха!</b> 🔥 \n"
                "<b>Черепаха</b> — <i>терпеливая, осторожная, мудрая.</i> 😎"
    },
    "Панда": {
        "image": "panda.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "75762f49-479f-4c76-8884-b19e77b763c6.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Панда!</b> 🔥 \n"
                "<b>Панда</b> — <i>спокойная, добродушная, уютная.</i> 😎"
    },
    "Тигр": {
        "image": "tiger.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "71062cdc-ae27-432a-84ed-d3743afd903b.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Тигр!</b> 🔥 \n"
                "<b>Тигр</b> — <i>мощный, решительный, страстный.</i> 😎"
    },
    "Олень": {
        "image": "deer.jpg",
        "url": "https://www.humaneworld.org/sites/default/files/styles/responsive_3_2_1400w/public/2023-11/"
               "deer-iStock-472096009_531436.jpg.webp?itok=lllVIvjr",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Олень!</b> 🔥 \n"
                "<b>Олень</b> — <i>изящный, чувствительный, миролюбивый.</i> 😎"
    },
    "Пантера": {
        "image": "panther.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "b897ad6d-f35b-44c6-9ba5-f46e43a31105.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Пантера!</b> 🔥 \n"
                "<b>Пантера</b> — <i>грациозная, скрытная, сильная.</i> 😎"
    },
    "Фенек": {
        "image": "fennec_fox.jpg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "ccce6738-8fbb-4100-88ca-848beafd4c95.jpg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Фенек!</b> 🔥 \n"
                "<b>Фенек</b> — <i>игривый, любопытный, активный.</i> 😎"
    },
    "Ёж": {
        "image": "hedgehog.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "464deb4e-6814-48ec-874f-38f8f53b5016.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Ёж!</b> 🔥 \n"
                "<b>Ёж</b> — <i>колючий, защитный, самостоятельный.</i> 😎"
    },
    "Жираф": {
        "image": "giraffe.jpg",
        "url": "https://sotni.ru/wp-content/uploads/2023/08/liubopytnyi-zhirafik-1.webp",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Жираф!</b> 🔥 \n"
                "<b>Жираф</b> — <i>высокомерный, дальновидный, уникальный.</i> 😎"
    },
    "Пингвин": {
        "image": "penguin.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "6bd7ccdb-e3a2-4353-9876-c38a0a717ca5.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Пингвин!</b> 🔥 \n"
                "<b>Пингвин</b> — <i>социальный, преданный, весёлый.</i> 😎"
    },
    "Крокодил": {
        "image": "crocodile.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "eff025da-3610-42ce-a3a8-b60c7b061738.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Крокодил!</b> 🔥 \n"
                "<b>Крокодил</b> — <i>терпеливый, опасный, стратегический.</i> 😎"
    },
    "Обезьяна": {
        "image": "monkey.jpg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "012fb391-2c89-4335-b1d7-1903aa31f014.jpg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Обезьяна!</b> 🔥 \n"
                "<b>Обезьяна</b> — <i>шумная, общительная, харизматичная.</i> 😎"
    },
    "Попугай": {
        "image": "parrot.jpeg",
        "url": "https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/"
               "a2e2fb91-5017-4951-9732-47fe63e72a11.jpeg",
        "text": "<i>Твое тотемное животное в Московском зоопарке</i> – <b>Попугай!</b> 🔥 \n"
                "<b>Попугай</b> — <i>креативный, коммуникабельный, яркий.</i> 😎"
    }
}
